/* mod_ets.c
 *
 * Copyright (C) 2006-2021 wolfSSL Inc.
 *
 * This file is part of wolf Key Manager.
 *
 * wolfKeyMgr is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfKeyMgr is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include "wolfkeymgr/mod_ets.h"
#include <signal.h>

struct EtsClientCtx {
    WOLFSSL_CTX*   sslCtx;
    WOLFSSL*       ssl;
    wolfSSL_Mutex  lock;
};


EtsClientCtx* wolfEtsClientNew(void)
{
    EtsClientCtx* client = (EtsClientCtx*)malloc(sizeof(EtsClientCtx));
    if (client) {
        memset(client, 0, sizeof(EtsClientCtx));
        wc_InitMutex(&client->lock);
        client->sslCtx = wolfTlsClientNew();
        if (client->sslCtx == NULL) {
            XLOG(WOLFKM_LOG_ERROR, "Error creating TLS client!\n");
            free(client);
            return NULL;
        }
    }
    return client;
}

int wolfEtsClientSetKey(EtsClientCtx* client, const char* keyFile,
    const char* keyPassword, const char* certFile, int fileType)
{
    int ret;
    if (client == NULL) {
        return WOLFKM_BAD_ARGS;
    }
    wc_LockMutex(&client->lock);
    ret = wolfTlsSetKey(client->sslCtx, keyFile, keyPassword, certFile, fileType);
    wc_UnLockMutex(&client->lock);
    return ret;
}

int wolfEtsClientAddCA(EtsClientCtx* client, const char* caFile)
{
    int ret;
    if (client == NULL) {
        return WOLFKM_BAD_ARGS;
    }

    wc_LockMutex(&client->lock);
    ret = wolfTlsAddCA(client->sslCtx, caFile);
    wc_UnLockMutex(&client->lock);
    return ret;
}

int wolfEtsClientConnect(EtsClientCtx* client, const char* host,
    word16 port, int timeoutSec)
{
    int ret;

    if (client == NULL) {
        return WOLFKM_BAD_ARGS;
    }

    wc_LockMutex(&client->lock);
    ret = wolfTlsConnect(client->sslCtx, &client->ssl, host, port, timeoutSec);
    if (ret == 0) {
        XLOG(WOLFKM_LOG_INFO, "Connected to ETS service\n");
    }
    else {
        XLOG(WOLFKM_LOG_ERROR, "Failure connecting to ETS service %d\n", ret);
        ret = WOLFKM_BAD_HOST;
    }
    wc_UnLockMutex(&client->lock);

    return ret;
}

const char* wolfEtsKeyNamedGroupStr(EtsKey* key)
{
    if (key == NULL)
        return NULL;
    switch (key->type) {
        case ETS_KEY_TYPE_SECP160K1:  return "0x000F"; /* 15 */
        case ETS_KEY_TYPE_SECP160R1:  return "0x0010"; /* 16 */
        case ETS_KEY_TYPE_SECP160R2:  return "0x0011"; /* 17 */
        case ETS_KEY_TYPE_SECP192K1:  return "0x0012"; /* 18 */
        case ETS_KEY_TYPE_SECP192R1:  return "0x0013"; /* 19 */
        case ETS_KEY_TYPE_SECP224K1:  return "0x0014"; /* 20 */
        case ETS_KEY_TYPE_SECP224R1:  return "0x0015"; /* 21 */
        case ETS_KEY_TYPE_SECP256K1:  return "0x0016"; /* 22 */
        case ETS_KEY_TYPE_SECP256R1:  return "0x0017"; /* 23 */
        case ETS_KEY_TYPE_SECP384R1:  return "0x0018"; /* 24 */
        case ETS_KEY_TYPE_SECP521R1:  return "0x0019"; /* 25 */
        case ETS_KEY_TYPE_BRAINPOOLP256R1: return "0x001A"; /* 26 */
        case ETS_KEY_TYPE_BRAINPOOLP384R1: return "0x001B"; /* 27 */
        case ETS_KEY_TYPE_BRAINPOOLP512R1: return "0x001C"; /* 28 */
        case ETS_KEY_TYPE_X25519:     return "0x001D"; /* 29 */
        case ETS_KEY_TYPE_X448:       return "0x001E"; /* 30 */
        case ETS_KEY_TYPE_FFDHE_2048: return "0x0100"; /* 256 */
        case ETS_KEY_TYPE_FFDHE_3072: return "0x0101"; /* 257 */
        case ETS_KEY_TYPE_FFDHE_4096: return "0x0102"; /* 258 */
        case ETS_KEY_TYPE_FFDHE_6144: return "0x0103"; /* 259 */
        case ETS_KEY_TYPE_FFDHE_8192: return "0x0104"; /* 260 */
        default: break;
    }
    return NULL;
}

int wolfEtsClientMakeRequest(EtsClientType type, const char* fingerprint,
    const char* groups, const char* contextstr, byte* request, word32* requestSz)
{
    int ret;
    char uri[HTTP_MAX_URI*3]; /* fingerprint, groups, contextStr */
    size_t uriLen;
    HttpHeader headers[1];
    HttpMethodType httpType;
    headers[0].type = HTTP_HDR_ACCEPT;
    headers[0].string = "application/pkcs8";

    /* Build HTTP ETS request */
    if (type == ETS_CLIENT_PUSH) {
        /* PUT for distributed push of keys */
        httpType = HTTP_METHOD_PUT;
        snprintf(uri, sizeof(uri), "/enterprise-transport-security/keys");
    }
    else {
        /* use GET with either fingerprint (with optional groups/context) */
        httpType = HTTP_METHOD_GET;
        strncpy(uri,
            "/.well-known/enterprise-transport-security/keys?fingerprints=",
            sizeof(uri));
